---
kind: method
id: M:Autodesk.Revit.DB.IFC.ImporterIFC.HybridCreateImportMap(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
source: html/710e883e-7076-c9df-1b1e-fcefbf275fa9.htm
---
# Autodesk.Revit.DB.IFC.ImporterIFC.HybridCreateImportMap Method

## Syntax (C#)
```csharp
public IDictionary<string, ElementId> HybridCreateImportMap(
	Document doc,
	IList<ElementId> elementIds
)
```

## Parameters
- **doc** (`Autodesk.Revit.DB.Document`)
- **elementIds** (`System.Collections.Generic.IList < ElementId >`)